RSN/src/InformationRegisters/СообщенияБрокеров/СообщенияБрокеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияБрокеров</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Топик</name>
    <type>
      <types>CatalogRef.Топики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/СообщенияБрокеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьСообщение(Знач Топик, Сообщение) Экспорт
	
	СообщениеКафки = СоздатьМенеджерЗаписи();   
	СообщениеКафки.Топик = Топик;  
	СообщениеКафки.НомерСообщения = Сообщение.offset;
	СообщениеКафки.Идентификатор = Сообщение.key;
	СообщениеКафки.ТекстСообщения = ЗаписатьЗначениеJSON(Сообщение.value);
	СообщениеКафки.ВремяЗаписи = ТекущаяДата();
	СообщениеКафки.Записать(); 	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
